//극장 예약 시스템

/*
배열을 이용하여 간단한 극장 예약시스템을 작성하여보자.
아주 작은 극장이라서 좌석이 10개밖에 안된다.
사용자가 예약을 하려고하면 먼저 좌석 배치표를 보여준다.
즉, 예약이 끝난 좌석은 1로, 예약이 안 된 좌석은 0으로 나타낸다.

실행결과
좌석을 예약하시겠습니까?(y 또는n) y
----------------------------
1 2 3 4 5 6 7 8 9 10
----------------------------
0 0 0 0 0 0 0 0 0 0 
몇번째 좌석을 예약하시겠습니까1
예약되었습니다.
좌석을 예약하시겠습니까?(y 또는n) y
----------------------------
1 2 3 4 5 6 7 8 9 10
----------------------------
1 0 0 0 0 0 0 0 0 0
몇번째 좌석을 예약하시겠습니까1
이미 예약된 자리입니다.
좌석을 예약하시겠습니까?(y 또는n)
*/


#include <stdio.h>

int main(){
    printf("test");
    return 0;
}