//극장 예약 시스템

/*
배열을 이용하여 간단한 극장 예약시스템을 작성하여보자.
아주 작은 극장이라서 좌석이 10개밖에 안된다.
사용자가 예약을 하려고하면 먼저 좌석 배치표를 보여준다.
즉, 예약이 끝난 좌석은 1로, 예약이 안 된 좌석은 0으로 나타낸다.

실행결과
좌석을 예약하시겠습니까?(y 또는n) y
----------------------------
1 2 3 4 5 6 7 8 9 10
----------------------------
0 0 0 0 0 0 0 0 0 0 
몇번째 좌석을 예약하시겠습니까1
예약되었습니다.
좌석을 예약하시겠습니까?(y 또는n) y
----------------------------
1 2 3 4 5 6 7 8 9 10
----------------------------
1 0 0 0 0 0 0 0 0 0
몇번째 좌석을 예약하시겠습니까1
이미 예약된 자리입니다.
좌석을 예약하시겠습니까?(y 또는n)
*/

#include <stdio.h>
#define Size 10

char seat_agree;
int i, j = 0;
int seat[10];

int main(void){
    printf("\n좌석을 예약하시겠습니까?(y 또는n) ");
    while(1) {
        //while문 안에 printf("\n좌석을 예약하시겠습니까?(y 또는n) ");를 넣으면 2번 반복됨. 이유를 모르겠어서 밖으로 뺌
        scanf("%c", &seat_agree);
        if (seat_agree == 'y')
        {
            printf("---------------------------------\n");
            for(i = 0; i < Size; i++){
                printf(" %d", i+1);
            }
            printf("\n---------------------------------\n");
            for(i = 0; i < Size; i++){
                printf(" %d", seat[i]);
            }
            printf("\n몇번째 좌석을 예약하시겠습니까");
            scanf("%d", &j);
            if(seat[j-1] != 0){
                printf("이미 예약된 자리입니다.");
                printf("\n좌석을 예약하시겠습니까?(y 또는n) ");
            } else {
                seat[j - 1] = 1;
                printf("\n예약되었습니다.\n");
                printf("\n좌석을 예약하시겠습니까?(y 또는n) ");
            }
        }
        else if (seat_agree == 'n')
        {
            printf("예약 취소\n");
            break;
        }
    }
}